# SculptingLoopsOnBothSidesOfAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..SculptingLoopsOnBothSidesOfAxis Property
BuiltInFailures..::..SketchFailures Class See Also
---
All curves must be on the same side of the axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SculptingLoopsOnBothSidesOfAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SculptingLoopsOnBothSidesOfAxis As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SculptingLoopsOnBothSidesOfAxis {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace